18-rails-dunder-mifflin-review/app/views/dogs/show.html.erb

looked after by:
<% @dog.employees.each do |employee| %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."dog_id" = ?  [["dog_id", 1]]